# 실버2
# 잃어버린 괄호
test_case = input()

num = test_case.split('-')

one_pick = False
if num[0].find("-") == -1 and num[0].find("+") == -1:
    result = int(num[0])
else:
    result = eval(num[0])

for i in range(1, len(num)):
    if num[i].find("-") == -1 and num[i].find("+") == -1:
        calc_data = int(num[i])
    else:
        calc_data = eval(num[i])
    result -= calc_data
print(result)

# ㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎㅎ......

"""
반례

55-50+40

10+20+30+40

0-10-20+30-40

00009-00009
9-4606+4-4606+4-4606+4+2453+9-55
0-8994+8+00-610+722+6691-482+65-3
-17575
9-4606+4-2-44-3-5442+2453+9-55
-12609
4-662+1067+0+4-85-7993+4+9432+139
-19382
3-6-5-75+991-6310-331+844-196+3
-8758
1-76+77-16-213+1+8800+61-776-18
-10037
6-3+5+6-8
-16
5+4-2+9+8
-10
1-8+1-8-8
-24
5-8+5+4+7
-19
8-2+1-4+8
-7
5-4+5
-4
7-6+7
-6
5-8+5
-8
5-2+5
-2
2-9+2
-9
"""